#### Terraform Format and Style 🖌``
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>GitHub Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vystmo-inc/gh-actions-demo/runs/run-WAFpMtWtWE3VosaM

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

azurerm_resource_group.rg-tcloud-azure: Refreshing state... [id=/subscriptions/8534e7bb-0c6b-4358-9861-7e972e81a5ea/resourceGroups/rg-tcloud-azure]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_subnet.internal will be created
  + resource "azurerm_subnet" "internal" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "rg-tcloud-azure"
      + service_endpoints                              = [
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "az-network"
    }

  # azurerm_virtual_network.azcloud will be created
  + resource "azurerm_virtual_network" "azcloud" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "northcentralus"
      + name                  = "az-network"
      + resource_group_name   = "rg-tcloud-azure"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @Laxman-SM, Action: `pull_request`, Workflow: `CI`*